Revit 2027 API
FabricationConfiguration.IsAncillaryKit Method
 Gets whether the specified fabrication ancillary identifier is an ancillary kit or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAncillaryKit(
	int ancillaryId
)
Public Function IsAncillaryKit (
	ancillaryId As Integer
) As Boolean
public:
bool IsAncillaryKit(
	int ancillaryId
)
member IsAncillaryKit :
        ancillaryId : int -> bool
Parameters
ancillaryId Int32
 The fabrication ancillary database identifier of the ancillary.
Return Value
Boolean
 Returns true if the ancillary is a kit.
Exceptions
Exception | Condition
ArgumentException |  The ancillary does not exist.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace